{"format": "layers-model", "generatedBy": "keras v3.13.2", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.13.2", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_3", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_5", "optional": false}, "name": "input_layer_5", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "MobileNetV3Small", "trainable": false, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_4", "optional": false}, "name": "input_layer_4", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 224, 224, 3], "dtype": "float32", "keras_history": ["input_layer_4", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "conv_bn", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "conv_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 112, 112, 16], "dtype": "float32", "keras_history": ["conv", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "activation_18", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "hard_silu"}, "name": "activation_18", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 112, 112, 16], "dtype": "float32", "keras_history": ["conv_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv_depthwise_pad", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "expanded_conv_depthwise_pad", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 112, 112, 16], "dtype": "float32", "keras_history": ["activation_18", 0, 0]}}], "kwargs": {}}]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_depthwise", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "expanded_conv_depthwise", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 113, 113, 16], "dtype": "float32", "keras_history": ["expanded_conv_depthwise_pad", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_depthwise_bn", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "expanded_conv_depthwise_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 16], "dtype": "float32", "keras_history": ["expanded_conv_depthwise", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "ReLU", "config": {"name": "re_lu_14", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_14", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 16], "dtype": "float32", "keras_history": ["expanded_conv_depthwise_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_squeeze_excite_avg_pool", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last", "keepdims": true}, "name": "expanded_conv_squeeze_excite_avg_pool", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 16], "dtype": "float32", "keras_history": ["re_lu_14", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_squeeze_excite_conv", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_squeeze_excite_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 16], "dtype": "float32", "keras_history": ["expanded_conv_squeeze_excite_avg_pool", 0, 0]}}], "kwargs": {}}]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_squeeze_excite_relu", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_squeeze_excite_relu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 8], "dtype": "float32", "keras_history": ["expanded_conv_squeeze_excite_conv", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_squeeze_excite_conv_1", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_squeeze_excite_conv_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 8], "dtype": "float32", "keras_history": ["expanded_conv_squeeze_excite_relu", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Add", "config": {"name": "add_9"}, "name": "add_9", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 16], "dtype": "float32", "keras_history": ["expanded_conv_squeeze_excite_conv_1", 0, 0]}}, 3.0], "kwargs": {}}]}, {"class_name": "ReLU", "config": {"name": "re_lu_15", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_15", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 16], "dtype": "float32", "keras_history": ["add_9", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Multiply", "config": {"name": "multiply_9"}, "name": "multiply_9", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 16], "dtype": "float32", "keras_history": ["re_lu_15", 0, 0]}}, 0.16666666666666666], "kwargs": {}}]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_squeeze_excite_mul", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "name": "expanded_conv_squeeze_excite_mul", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 16], "dtype": "float32", "keras_history": ["re_lu_14", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 16], "dtype": "float32", "keras_history": ["multiply_9", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_project", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_project", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 16], "dtype": "float32", "keras_history": ["expanded_conv_squeeze_excite_mul", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_project_bn", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "expanded_conv_project_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 16], "dtype": "float32", "keras_history": ["expanded_conv_project", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_1_expand", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_1_expand", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 16], "dtype": "float32", "keras_history": ["expanded_conv_project_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1_expand_bn", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "expanded_conv_1_expand_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 72], "dtype": "float32", "keras_history": ["expanded_conv_1_expand", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "ReLU", "config": {"name": "re_lu_16", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_16", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 72], "dtype": "float32", "keras_history": ["expanded_conv_1_expand_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv_1_depthwise_pad", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "expanded_conv_1_depthwise_pad", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 72], "dtype": "float32", "keras_history": ["re_lu_16", 0, 0]}}], "kwargs": {}}]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_1_depthwise", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "expanded_conv_1_depthwise", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 57, 57, 72], "dtype": "float32", "keras_history": ["expanded_conv_1_depthwise_pad", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1_depthwise_bn", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "expanded_conv_1_depthwise_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 72], "dtype": "float32", "keras_history": ["expanded_conv_1_depthwise", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "ReLU", "config": {"name": "re_lu_17", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_17", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 72], "dtype": "float32", "keras_history": ["expanded_conv_1_depthwise_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_1_project", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_1_project", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 72], "dtype": "float32", "keras_history": ["re_lu_17", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1_project_bn", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "expanded_conv_1_project_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 24], "dtype": "float32", "keras_history": ["expanded_conv_1_project", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_2_expand", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 88, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_2_expand", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 24], "dtype": "float32", "keras_history": ["expanded_conv_1_project_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2_expand_bn", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "expanded_conv_2_expand_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 88], "dtype": "float32", "keras_history": ["expanded_conv_2_expand", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "ReLU", "config": {"name": "re_lu_18", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_18", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 88], "dtype": "float32", "keras_history": ["expanded_conv_2_expand_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_2_depthwise", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "expanded_conv_2_depthwise", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 88], "dtype": "float32", "keras_history": ["re_lu_18", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2_depthwise_bn", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "expanded_conv_2_depthwise_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 88], "dtype": "float32", "keras_history": ["expanded_conv_2_depthwise", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "ReLU", "config": {"name": "re_lu_19", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_19", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 88], "dtype": "float32", "keras_history": ["expanded_conv_2_depthwise_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_2_project", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_2_project", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 88], "dtype": "float32", "keras_history": ["re_lu_19", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2_project_bn", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "expanded_conv_2_project_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 24], "dtype": "float32", "keras_history": ["expanded_conv_2_project", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Add", "config": {"name": "expanded_conv_2_add", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "name": "expanded_conv_2_add", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 24], "dtype": "float32", "keras_history": ["expanded_conv_1_project_bn", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 24], "dtype": "float32", "keras_history": ["expanded_conv_2_project_bn", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3_expand", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3_expand", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 24], "dtype": "float32", "keras_history": ["expanded_conv_2_add", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3_expand_bn", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "expanded_conv_3_expand_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 96], "dtype": "float32", "keras_history": ["expanded_conv_3_expand", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "activation_19", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "hard_silu"}, "name": "activation_19", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 96], "dtype": "float32", "keras_history": ["expanded_conv_3_expand_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv_3_depthwise_pad", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "name": "expanded_conv_3_depthwise_pad", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 96], "dtype": "float32", "keras_history": ["activation_19", 0, 0]}}], "kwargs": {}}]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_3_depthwise", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "depth_multiplier": 1, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3_depthwise", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 31, 31, 96], "dtype": "float32", "keras_history": ["expanded_conv_3_depthwise_pad", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3_depthwise_bn", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "expanded_conv_3_depthwise_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 96], "dtype": "float32", "keras_history": ["expanded_conv_3_depthwise", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "activation_20", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "hard_silu"}, "name": "activation_20", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 96], "dtype": "float32", "keras_history": ["expanded_conv_3_depthwise_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_3_squeeze_excite_avg_pool", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last", "keepdims": true}, "name": "expanded_conv_3_squeeze_excite_avg_pool", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 96], "dtype": "float32", "keras_history": ["activation_20", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3_squeeze_excite_conv", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3_squeeze_excite_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 96], "dtype": "float32", "keras_history": ["expanded_conv_3_squeeze_excite_avg_pool", 0, 0]}}], "kwargs": {}}]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_3_squeeze_excite_relu", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_3_squeeze_excite_relu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 24], "dtype": "float32", "keras_history": ["expanded_conv_3_squeeze_excite_conv", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3_squeeze_excite_conv_1", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3_squeeze_excite_conv_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 24], "dtype": "float32", "keras_history": ["expanded_conv_3_squeeze_excite_relu", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Add", "config": {"name": "add_10"}, "name": "add_10", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 96], "dtype": "float32", "keras_history": ["expanded_conv_3_squeeze_excite_conv_1", 0, 0]}}, 3.0], "kwargs": {}}]}, {"class_name": "ReLU", "config": {"name": "re_lu_20", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_20", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 96], "dtype": "float32", "keras_history": ["add_10", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Multiply", "config": {"name": "multiply_10"}, "name": "multiply_10", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 96], "dtype": "float32", "keras_history": ["re_lu_20", 0, 0]}}, 0.16666666666666666], "kwargs": {}}]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_3_squeeze_excite_mul", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "name": "expanded_conv_3_squeeze_excite_mul", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 96], "dtype": "float32", "keras_history": ["activation_20", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 96], "dtype": "float32", "keras_history": ["multiply_10", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3_project", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3_project", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 96], "dtype": "float32", "keras_history": ["expanded_conv_3_squeeze_excite_mul", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3_project_bn", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "expanded_conv_3_project_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 40], "dtype": "float32", "keras_history": ["expanded_conv_3_project", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4_expand", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4_expand", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 40], "dtype": "float32", "keras_history": ["expanded_conv_3_project_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_4_expand_bn", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "expanded_conv_4_expand_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 240], "dtype": "float32", "keras_history": ["expanded_conv_4_expand", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "activation_21", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "hard_silu"}, "name": "activation_21", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 240], "dtype": "float32", "keras_history": ["expanded_conv_4_expand_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_4_depthwise", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "depth_multiplier": 1, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4_depthwise", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 240], "dtype": "float32", "keras_history": ["activation_21", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_4_depthwise_bn", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "expanded_conv_4_depthwise_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 240], "dtype": "float32", "keras_history": ["expanded_conv_4_depthwise", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Activation", "config": {"name": "activation_22", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "hard_silu"}, "name": "activation_22", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 240], "dtype": "float32", "keras_history": ["expanded_conv_4_depthwise_bn", 0, 0]}}], "kwargs": {}}]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_4_squeeze_excite_avg_pool", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last", "keepdims": true}, "name": "expanded_conv_4_squeeze_excite_avg_pool", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 240], "dtype": "float32", "keras_history": ["activation_22", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4_squeeze_excite_conv", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4_squeeze_excite_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 240], "dtype": "float32", "keras_history": ["expanded_conv_4_squeeze_excite_avg_pool", 0, 0]}}], "kwargs": {}}]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_4_squeeze_excite_relu", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_4_squeeze_excite_relu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 1, 64], "dtype": "float32", "keras_history": ["expanded_conv_4_squeeze_excite_conv", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4_squeeze_excite_conv_1", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, 